app/views/teams/show.html.erb

              <ul>
                <% @team.athletes.each do |athlete| %>
---
SELECT "athletes".* FROM "athletes" WHERE "athletes"."team_id" = ?  [["team_id", 1]]

            <ul>
              <% @team.events.uniq.each do |event| %>
---
SELECT "events".* FROM "events" INNER JOIN "scores" ON "events"."id" = "scores"."event_id" WHERE "scores"."team_id" = ?  [["team_id", 4]]