app/views/competitions/index.html.erb

          <%= competition.description %><br>
          <% if competition.events.any?{|event| event.scores != [] } %>
---
SELECT "events".* FROM "events" WHERE "events"."competition_id" = ?  [["competition_id", 2]]
SELECT "scores".* FROM "scores" WHERE "scores"."event_id" = ?  [["event_id", 3]]