app/views/competitions/show.html.erb

      <ul>
        <% @competition.teams.each do|team| %>
---
SELECT "teams".* FROM "teams" WHERE "teams"."competition_id" = ?  [["competition_id", 2]]

      <ul>
        <% @competition.events.each do|event| %>
---
SELECT "events".* FROM "events" WHERE "events"."competition_id" = ?  [["competition_id", 2]]