app/views/competitions/stats.html.erb

    <div class="col">
      <h4 class= "text-white">Total Number of Events: <%= @competition.events.count %></h4>
      <h4 class= "text-white">Total Number of Teams:  <%= @competition.events.count %></h4>
---
SELECT "events".* FROM "events" WHERE "events"."competition_id" = ?  [["competition_id", 1]]
SELECT COUNT(*) FROM "events" WHERE "events"."competition_id" = ?  [["competition_id", 2]]

    <div class="col">
      <% @competition.events.each do |event| %>
---
SELECT "events".* FROM "events" WHERE "events"."competition_id" = ?  [["competition_id", 2]]