app/views/scores/_form.html.erb

SELECT "events".* FROM "events"
SELECT "teams".* FROM "teams"
---
<h4><span class= "text-white"> Event: </span></h4>
<%= f.collection_select :event_id, Event.all, :id, :title, {:prompt => "Please select an Event"} %><br>
<h4><span class= "text-white"> Team: </span></h4>
<%= f.collection_select :team_id, Team.all, :id, :name, {:prompt => "Please select a Team" } %><br><br>