app/views/scores/competition_scores.html.erb

SELECT "events".* FROM "events" WHERE "events"."competition_id" = ?  [["competition_id", 2]]
SELECT "scores".* FROM "scores" WHERE "scores"."event_id" = ?  [["event_id", 3]]
---
<h1><%= @competition.name %> Scores:</h1>
  <% @competition.events.each do |event| %>
    <h2><%= event.title %></h2>
    <% event.scores.each do |score| %>