app/views/scores/event_scores.html.erb

			<span class= "text-white">
				<% @event.scores.each do |score|%>
---
SELECT "scores".* FROM "scores" WHERE "scores"."event_id" = ?  [["event_id", 3]]