app/views/scores/team_scores.html.erb

SELECT "scores".* FROM "scores" WHERE "scores"."team_id" = ?  [["team_id", 2]]
---
			<span class= "text-white">
				<% @team.scores.each do |score|%>