app/views/athletes/_form.html.erb

SELECT "teams".* FROM "teams"
---
        <h4><span class= "text-white"> Team: </span></h4>
        <%= f.collection_select :team_id, Team.all, :id, :name %><br><br><br>