app/views/athletes/show.html.erb

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "athletes".* FROM "athletes" WHERE "athletes"."team_id" = ?  [["team_id", 2]]
---
      <ul>
        <% @athlete.team.athletes.each do |athlete| %>

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "events".* FROM "events" INNER JOIN "scores" ON "events"."id" = "scores"."event_id" WHERE "scores"."team_id" = ?  [["team_id", 2]]
---
      <ul>
        <% @athlete.team.events.uniq.each do |event| %>