app/views/events/_form.html.erb

                <h4><span class= "text-white"> Competition: </span></h4>
                <%= f.collection_select :competition_id, Competition.all, :id, :name, {:prompt => "Please select a Competition"} %><br>
---
SELECT "competitions".* FROM "competitions"