app/views/events/show.html.erb

SELECT "teams".* FROM "teams" INNER JOIN "scores" ON "teams"."id" = "scores"."team_id" WHERE "scores"."event_id" = ?  [["event_id", 8]]
---
      <ul>
        <% @event.teams.uniq.each do |team| %>