app/controllers/application_controller.rb

  def current_user
    if session[:user_id]
      @user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def competition_user_authinticate
    user_id = Competition.find(params[:id]).competition_manager_id
---
SELECT  "competitions".* FROM "competitions" WHERE "competitions"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def event_user_authenticate
    event_manager_id = Event.find(params[:id]).event_manager_id
    competition_manager_id = Event.find(params[:id]).competition.competition_manager_id
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "competitions".* FROM "competitions" WHERE "competitions"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

  def team_user_authenticate
    team_manager_id = Team.find(params[:id]).team_manager_id
    compeition_manager_id = Team.find(params[:id]).competition.competition_manager_id
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "competitions".* FROM "competitions" WHERE "competitions"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def athlete_user_authenticate
    team_manager_id = Athlete.find(params[:id]).team.team_manager_id
    compeition_manager_id = Athlete.find(params[:id]).team.competition.competition_manager_id
---
SELECT  "athletes".* FROM "athletes" WHERE "athletes"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "competitions".* FROM "competitions" WHERE "competitions"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def score_user_authenticate
    event_manager_id = Score.find(params[:id]).event.event_manager_id
    competition_manager_id = Score.find(params[:id]).event.competition.competition_manager_id
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "scores".* FROM "scores" WHERE "scores"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT  "competitions".* FROM "competitions" WHERE "competitions"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]