app/controllers/athletes_controller.rb

SELECT "athletes".* FROM "athletes"
---
    def index
        @athletes = Athlete.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @user = session[:user_id] == nil ? nil : User.find(session[:user_id])

UPDATE "athletes" SET "state" = ?, "updated_at" = ? WHERE "athletes"."id" = ?  [["state", "AL"], ["updated_at", "2019-05-09 16:35:08.613142"], ["id", 13]]
---
    def update
        athlete = Athlete.new(athlete_params)
        if athlete.valid?
          current_athlete
          @athlete.update(athlete_params)

SELECT  "athletes".* FROM "athletes" WHERE "athletes"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
---
    def current_athlete
        @athlete = Athlete.find(params[:id])