app/controllers/competitions_controller.rb

SELECT "competitions".* FROM "competitions"
---
    def index
        @competitions = Competition.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def show
      @user = session[:user_id] == nil ? nil : User.find(session[:user_id])

SELECT "users".* FROM "users"
---
    def new
        @competition = Competition.new
        @competition_managers = User.select {|user| user.user_type == "Competition Manager"}

INSERT INTO "competitions" ("name", "description", "location", "datetime", "status", "competition_manager_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @competition = Competition.new(competition_params)
        if @competition.valid?
            @competition.save

SELECT "users".* FROM "users"
---
    def edit
      @competition_managers = User.select {|user| user.user_type == "Competition Manager"}

UPDATE "competitions" SET "name" = ?, "datetime" = ?, "updated_at" = ? WHERE "competitions"."id" = ?  [["name", "Gliding Over Some"], ["datetime", "2019-05-13 00:00:00"], ["updated_at", "2019-05-09 14:33:30.756404"], ["id", 2]]
---
    def update
        competition = Competition.new(competition_params)
        if competition.valid?
          current_competition
          @competition.update(competition_params)

SELECT  "competitions".* FROM "competitions" WHERE "competitions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def current_competition
        @competition = Competition.find(params[:id])