app/controllers/events_controller.rb

    def new
        @event = Event.new
        @event_managers = User.select {|user| user.user_type == "Event Manager" || user.user_type == "Competition Manager" }
---
SELECT "competitions".* FROM "competitions"
SELECT "users".* FROM "users"

    def show
        @user = session[:user_id] == nil ? nil : User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @event = Event.new(event_params)
        if @event.valid?
            @event.save
---
INSERT INTO "events" ("title", "description", "score_type", "competition_id", "event_manager_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def edit
      @event_managers = User.select {|user| user.user_type == "Event Manager" || user.user_type == "Competition Manager" }
---
SELECT "competitions".* FROM "competitions"
SELECT "users".* FROM "users"

    def update
        event = Event.new(event_params)
        if event.valid?
          current_event
          @event.update(event_params)
---
UPDATE "events" SET "title" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["title", "Carry squid art party"], ["updated_at", "2019-05-09 16:34:20.209907"], ["id", 3]]

    def current_event
        @event = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]