app/controllers/scores_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
      @user = session[:user_id] == nil ? nil : User.find(session[:user_id])

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def event_scores
      @event = Event.all.find(params[:id])

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def team_scores
      @team = Team.all.find(params[:id])

SELECT  "competitions".* FROM "competitions" WHERE "competitions"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def competition_scores
      @competition = Competition.all.find(params[:id])

SELECT  "scores".* FROM "scores" WHERE "scores"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
    def current_score
      @score = Score.find(params[:id])