app/controllers/teams_controller.rb

    def show
      @user = session[:user_id] == nil ? nil : User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def new
      @team = Team.new
      @team_managers = User.select {|user| user.user_type == "Team Manager" || user.user_type == "Competition Manager" }
---
SELECT "competitions".* FROM "competitions"
SELECT "users".* FROM "users"

    def create
      @team = Team.new(team_params)
      if @team.valid?
        @team.save
---
INSERT INTO "teams" ("name", "location", "sponsor", "team_type", "mascot", "competition_id", "team_manager_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

    def edit
      @team_managers = User.select {|user| user.user_type == "Team Manager" || user.user_type == "Competition Manager" }
---
SELECT "competitions".* FROM "competitions"
SELECT "users".* FROM "users"

    def update
      team = Team.new(team_params)
      if team.valid?
        current_team
        @team.update(team_params)
---
UPDATE "teams" SET "location" = ?, "updated_at" = ? WHERE "teams"."id" = ?  [["location", "MS"], ["updated_at", "2019-05-09 15:44:10.328238"], ["id", 2]]

    def current_team
      @team = Team.find(params[:id])
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]