app/controllers/users_controller.rb

INSERT INTO "users" ("name", "username", "password_digest", "user_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.valid?
      @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "competitions".* FROM "competitions"
SELECT  "competitions".* FROM "competitions" WHERE "competitions"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "events".* FROM "events"
SELECT  "competitions".* FROM "competitions" WHERE "competitions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "teams".* FROM "teams"
SELECT "events".* FROM "events" WHERE "events"."competition_id" = ?  [["competition_id", 2]]
SELECT "events".* FROM "events" INNER JOIN "scores" ON "events"."id" = "scores"."event_id" WHERE "scores"."team_id" = ?  [["team_id", 2]]
SELECT "teams".* FROM "teams" WHERE "teams"."competition_id" = ?  [["competition_id", 2]]
SELECT "teams".* FROM "teams" INNER JOIN "scores" ON "teams"."id" = "scores"."team_id" WHERE "scores"."event_id" = ?  [["event_id", 3]]
---
  def show
    @user = User.find(session[:user_id])
    if @user.user_type == "Competition Manager"
      @competitions = Competition.all.select{|competition| competition.competition_manager_id == session[:user_id]}
      @events = Event.all.select{|event| event.competition.competition_manager_id == session[:user_id]}
      @teams = Team.all.select{|team| team.competition.competition_manager_id == session[:user_id]}
    elsif @user.user_type == "Event Manager"
      @competitions = Competition.all.select{|competition| competition.events.any?{|event| event.event_manager_id == session[:user_id]}}.uniq
      @events = Event.all.select{|event| event.event_manager_id == session[:user_id]}
      @teams = Team.all.select{|team| team.events.any?{|event| event.event_manager_id == session[:user_id]}}.uniq
    elsif @user.user_type == "Team Manager"
      @competitions = Competition.all.select{|competition| competition.teams.any?{|team| team.team_manager_id == session[:user_id]}}.uniq
      @events = Event.all.select{|event| event.teams.any?{|team| team.team_manager_id == session[:user_id]}}.uniq
      @teams = Team.all.select{|team| team.team_manager_id == session[:user_id]}

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "j"], ["LIMIT", 1]]
---
  def session_login
    @user = User.find_by(username_param)