app/models/event.rb

    def average_score
      #returns the average score for the event
      if scores == []
        "Event has not been Scored."
      else
        avg = scores.map{|score| score.score }.inject{ |sum, score| sum + score } / scores.size
---
SELECT "scores".* FROM "scores" WHERE "scores"."event_id" = ?  [["event_id", 1]]