app/views/layouts/application.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
            <li class="nav-item">
              <a class= "nav-link js-scroll-trigger text-info" href="<%= user_path(session[:user_id]) %>" > [ WELCOME <%= User.find(session[:user_id]).name.upcase %> | DASHBOARD ]</a>